src/InformationRegisters/кфкВходящиеСообщения/кфкВходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкВходящиеСообщения</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.кфкСтатусыСообщений</types>
    </type>
  </resources>
  <resources>
    <name>Заголовки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТелоСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Консьюмер</name>
    <type>
      <types>CatalogRef.кфкКонсьюмеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Топик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Раздел</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смещение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлОбработкиМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЖурнала</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбработок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеткаИзменения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>КлючЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МеткаЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/кфкВходящиеСообщения/Forms/ФормаЗаписи/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область ОписаниеПеременных

&НаКлиенте
Перем РедакторJSON; // ВнешнийОбъект

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	ТолькоПросмотр = Истина;
	Элементы.ФормаОбработатьСообщение.Доступность = кфкОбщегоНазначенияСлужебный.ЭтоПолноправныйПользователь();
	
	Элементы.ДлОбработкиМС.ФорматРедактирования = ?(ЗначениеЗаполнено(Запись.ДатаОбработки), "ЧН='<1';", "ЧН=;");
	
	ВерсияРедактораJSON = кфкИнтеграцияСлужебныйПовтИсп.ВерсияРедактораJSON();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ТелоСообщения
	ТелоСообщения = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(ТекущийОбъект.ТелоСообщения); // Строка
	АдресТелаСообщения = ПоместитьВоВременноеХранилище(ТелоСообщения, УникальныйИдентификатор);
	
	// Заголовки
	Заголовки.Очистить();
	ЗаголовкиИБ = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(ТекущийОбъект.Заголовки); // Неопределено, Соответствие Из Строка
	Если ЗаголовкиИБ <> Неопределено Тогда
		Для Каждого КлючЗначение Из ЗаголовкиИБ Цикл
			ЗаполнитьЗначенияСвойств(Заголовки.Добавить(), КлючЗначение);
		КонецЦикла;
	КонецЕсли;
	Элементы.СтраницаЗаголовки.Доступность = Заголовки.Количество() > 0;
	
	// ТекстЖурнала
	Элементы.СтраницаТекстЖурнала.Доступность = Не ПустаяСтрока(ТекущийОбъект.ТекстЖурнала);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	кфкИнтеграцияСлужебныйКлиент.ИнициализироватьРедакторJSON(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницаРедактораJSONДокументСформирован(Элемент)
	
	Если РедакторJSON = Неопределено Тогда
		//@skip-check property-return-type
		//@skip-check dynamic-access-method-not-found
		РедакторJSON = Элемент.Документ.defaultView.Init(); // ВнешнийОбъект
		Если РедакторJSON = Неопределено Тогда // Ошибка инициализации
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//@skip-check property-return-type
	РедакторJSON.menu.style.backgroundColor = "#d0d0d0";
	//@skip-check dynamic-access-method-not-found
	РедакторJSON.focus();
	
	ТелоСообщения = ПолучитьИзВременногоХранилища(АдресТелаСообщения); // Строка
	//@skip-check dynamic-access-method-not-found
	РедакторJSON.setText(ТелоСообщения);
	
	//@skip-check dynamic-access-method-not-found
	РедакторJSON.setMode("tree");
	
КонецПроцедуры

&НаКлиенте
Процедура РедакторJSONРежимТекстаПриИзменении(Элемент)
	
	Если РедакторJSON = Неопределено Тогда // Редактор не инициализирован
		Возврат;
	КонецЕсли;
	
	//@skip-check dynamic-access-method-not-found
	РедакторJSON.setMode(?(РедакторJSONРежимТекста, "code", "tree"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьСообщение(Команда)
	
	ОчиститьСообщения();
	
	Если Не ОбработкаДоступна() Тогда
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучнойОбработки();
		Возврат;
	КонецЕсли;
	
	ОбработатьСообщениеНаСервере();
	
	кфкИнтеграцияСлужебныйКлиент.ИнициализироватьРедакторJSON(ЭтотОбъект);
	
	ОповеститьОбИзменении(Запись.ИсходныйКлючЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОбработкаДоступна()
	Возврат (ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции")
				Или Не кфкФоновыеОперацииСлужебный.РегламентноеЗадание().Использование)
			И кфкФоновыеОперацииСлужебный.ПолучитьПотоки(СостояниеФоновогоЗадания.Активно).Количество() = 0;
КонецФункции

&НаСервере
Процедура ОбработатьСообщениеНаСервере()
	
	кфкФоновыеОперацииСлужебный.ДесериализацияСообщения(Запись.ИсходныйКлючЗаписи);
	
	Прочитать();
	
КонецПроцедуры

#КонецОбласти
